{
  "journals": [
    { "j_id":"10",
    "title":"Quantum Mechanical Model for Filament Formation in Metal-Insulator-Metal Memristors",
    "authors":"Iosif-Angelos Fyrigos, <strong>Vasileios Ntinas</strong>, Georgios Ch. Sirakoulis, Panagiotis Dimitrakis, Ioannis G. Karafyllidis",
    "details":"IEEE Transactions on Nanotechnology, vol. 20, pp. 113-122, 2021",
    "doi":"10.1109/TNANO.2021.3049632",
    "abstract":"Metal-Insulator-Metal type memristors as emergent nano-electronic devices have been successfully fabricated and used in non-conventional and neuromorphic computing systems in the last years. Several behavioral or physical based models have been developed to explain their operation and to optimize their fabrication parameters. Among them, the resistance switching of the insulating layer due to the formation of conductive filaments is the most well respected and experimentally proven. All existing memristor models are trade-offs between accuracy, universality and realism, but, to the best of our knowledge, none of them is purely characterized as quantum mechanical, despite the fact that quantum mechanical processes are a major part of the memristor operation. In this paper, we employ quantum mechanical methods to develop a complete and accurate filamentary model for the resistance variation during memristor's operating cycle. More specifically, we apply quantum walks to model and compute the motion of atoms forming the filament, tight-binding Hamiltonians to capture the filament structure and the Non-Equilibrium Green's Function (NEGF) method to compute the conductance of the device. Furthermore, we proceeded with the parallelization of the overall model through Graphical Processing Units (GPUs) to accelerate our computations and enhance the model's performance adequately. Our simulation results successfully reproduce the resistive switching characteristics of memristors devices, match with existing fabricated devices experimental data, prove the efficacy and robustness of the proposed model in terms of multi-parameterization, and provide a new and useful insight into its operation.",
    "sjr_id":"15464"},
    
    { "j_id":"9",
    "title":"Probabilistic Resistive Switching Device modeling based on Markov Jump processes",
    "authors":"<strong>Vasileios Ntinas</strong>, Antonio Rubio, Georgios Ch. Sirakoulis",
    "details":"IEEE Access, vol. 9, pp. 983-988, 2021",
    "doi":"10.1109/ACCESS.2020.3042012",
    "abstract":"In this work, a versatile mathematical framework for multi-state probabilistic modeling of Resistive Switching (RS) devices is proposed for the first time. The mathematical formulation of memristor and Markov jump processes are combined and, by using the notion of master equations for finite-states, the inherent probabilistic time-evolution of RS devices is sufficiently modeled. In particular, the methodology is generic enough and can be applied for N states; as a proof of concept, the proposed framework is further stressed for both a two-state RS paradigm, namely N=2 , and a multi-state device, namely N=4 . The presented I–V results demonstrate in a qualitative and quantitative manner, adequate matching with other modeling approaches.",
    "sjr_id":"21100374601"},
    
    { "j_id":"8",
    "title":"Power-efficient Noise-Induced Reduction of ReRAM Cell’s Temporal Variability Effects",
    "authors":"<strong>Vasileios Ntinas</strong>, Antonio Rubio, Georgios Ch. Sirakoulis, Emili Salvador Aguilera, Marta Pedro, Albert Crespo-Yepes, Javier Martin-Martinez, Rosana Rodriguez, Montserrat Nafria",
    "details":"IEEE Transactions on Circuits and Systems II: Express Briefs",
    "doi":"10.1109/TCSII.2020.3026950",
    "abstract":"Resistive Random Access Memory (ReRAM) is a promising novel memory technology for non-volatile storing, with low-power operation and ultra-high area density. However, ReRAM memories still face issues through commercialization, mainly owing to the fact that the high fabrication variations and the stochastic switching of the manufactured ReRAM devices cause high Bit Error Rate (BER). Given that ReRAM devices are nonlinear elements, the nonlinear phenomenon of Stochastic Resonance (SR), which defines that an input disturbance with specific characteristics can improve the total performance of the nonlinear system, is used to reduce the ReRAM cell’s BER. Thus, in this work, the BER of a single ReRAM cell is explored, using the Stanford PKU model, and is improved after the application of specific additive input noise. The power dissipation of the proposed approach is also evaluated and compared with the consideration of higher amplitude writing pulses in the lack of noise, showing that the proposed noise-induced technique can decrease the BER without the excessive increase of the power dissipation. As a first step, towards the experimental verification of the proposed method, noise-induced measurements on a single fabricated ReRAM device are also performed. Overall, the presented results of the BER reduction with low power dissipation, reaching up to 3.26× less power consumption considering 100 ns writing pulses, are encouraging for ReRAM designers, delivering a circuit-level solution against the device-level problem.",
    "sjr_id":"9500153930"},
    
    { "j_id":"7",
    "title":"A COMPLETE ANALYTICAL SOLUTION FOR THE ON AND OFF DYNAMIC EQUATIONS OF A TAO MEMRISTOR",
    "authors":"<strong>Vasileios Ntinas</strong>, Alon Ascoli, Ronald Tetzlaff, Georgios Ch. Sirakoulis",
    "details":"IEEE Transactions on Circuits and Systems II: Express Briefs, vol. 66, no. 4, pp. 682-686, 2019",
    "doi":"10.1109/TCSII.2018.2869920",
    "abstract":"In this brief we provide a complete analytical model for the time evolution of the state of a real-world memristor under any dc stimulus and for all initial conditions. The analytical dc model is derived through the application of mathematical techniques to Strachan's accurate mathematical description of a tantalum oxide nano-device from Hewlett Packard Labs. Under positive dc inputs the state equation of the Strachan model can be solved analytically, providing a closed-form expression for the device memory state response. However, to the best of our knowledge, the analytical integration of the state equation of the Strachan model under dc inputs of negative polarity is an unsolved mathematical problem. In order to bypass this issue, the state evolution function is first expanded in a series of Lagrange polynomials, which reproduces accurately the original model predictions on the device off-switching kinetics. The solution to the resulting state equation approximation may then be computed analytically by applying methods from the field of mathematics. Our full analytical model matches both qualitatively and quantitatively the tantalum oxide memristor response captured by the original differential algebraic equation set to typical stimuli of interest such as symmetric and asymmetric pulse excitations. It is further insensitive to the convergence issues that typically arise in the numerical integration of the original model, and may be easily integrated into software programs for circuit synthesis, providing designers with a reliable tool for exploratory studies on the capability of a certain circuit topology to satisfy given design specifications.",
    "sjr_id":"9500153930"},
    
    { "j_id":"6",
    "title":"EXPERIMENTAL STUDY OF ARTIFICIAL NEURAL NETWORKS USING A DIGITAL MEMRISTOR SIMULATOR",
    "authors":"<strong>Vasileios Ntinas</strong>, Ioannis Vourkas, Angel Abusleme, Georgios Ch. Sirakoulis, Antonio Rubio",
    "details":"IEEE Transactions on Neural Networks and Learning Systems (TNNLS), vol. 29, no. 10, pp. 5098-5110, Oct. 2018",
    "doi":"10.1109/TNNLS.2018.2791458",
    "abstract":"This paper presents a fully digital implementation of a memristor hardware (HW) simulator, as the core of an emulator, based on a behavioral model of voltage-controlled threshold-type bipolar memristors. Compared to other analog solutions, the proposed digital design is compact, easily reconfigurable, demonstrates very good matching with the mathematical model on which it is based, and complies with all the required features for memristor emulators. We validated its functionality using Altera Quartus II and ModelSim tools targeting low-cost yet powerful field-programmable gate array families. We tested its suitability for complex memristive circuits as well as its synapse functioning in artificial neural networks, implementing examples of associative memory and unsupervised learning of spatiotemporal correlations in parallel input streams using a simplified spike-timing-dependent plasticity. We provide the full circuit schematics of all our digital circuit designs and comment on the required HW resources and their scaling trends, thus presenting a design framework for applications based on our HW simulator.",
    "sjr_id":"21100235616"},
    
    { "j_id":"5",
    "title":"Closed-form analytical solution for on-switching dynamics in a TaO memristor",
    "authors":"Alon Ascoli, <strong>Vasileios Ntinas</strong>, Ronald Tetzlaff, Georgios Ch. Sirakoulis",
    "details":"IET Electronics Letters, vol. 50, no. 16, pp. 1125-1126, 2017",
    "doi":"10.1049/el.2017.1622",
    "abstract":"For the first time, the model of a physical nano-scale memristor is integrated analytically. A closed-form expression for the time evolution of the device memristance during the turn-on process is mathematically derived. The complexity of the inverse imaginary error function-based analytical formula clearly reflects the high degree of nonlinearity in the nano-device switching kinetics, which may typically span several orders of magnitude and is critically dependent on input and initial condition. The excellent agreement between the analytical solution and numerical simulation results clearly demonstrates the correctness of the theoretical derivation. The introduction of this formula represents the first step towards a systematic approach to circuit design with memristors.",
    "sjr_id":"24918"},
    
    { "j_id":"4",
    "title":"Memristor crossbar for adaptive synchronization",
    "authors":"Lucia Valentina Gambuzza, Mattia Frasca, Luigi Fortuna, <strong>Vasileios Ntinas</strong>, Ioannis Vourkas, Georgios Ch. Sirakoulis",
    "details":"IEEE Transactions on Circuits and Systems I: Regular Papers, vol. 64, no. 8, pp. 2124-2133, 2017",
    "doi":"10.1109/TCSI.2017.2692519",
    "abstract":"Nonlinear circuits may be synchronized with interconnections that evolve in time incorporating mechanisms of adaptation found in many biological systems. Such dynamics in the links is efficiently implemented in electronic devices by using memristors. However, the approach requires a massive amount of interconnections (of the order of N2, where N is the number of nonlinear circuits to be synchronized). This issue is solved in this paper by adopting a memristor crossbar architecture for adaptive synchronization. The functionality of the structure is demonstrated, with respect to different switching characteristics, via a simulation-based evaluation using a behavioral threshold-type model of voltage-controlled bipolar memristor. In addition, we show that the architecture is robust to device variability and faults: quite surprisingly, when faults are localized, the performance of the approach may also improve as adaptation becomes more significant.",
    "sjr_id":"11000153733"},
    
    { "j_id":"3",
    "title":"Modeling Physarum space exploration using memristors",
    "authors":"<strong>Vasileios Ntinas</strong>, Ioannis Vourkas, Georgios Ch. Sirakoulis, Andrew Adamatzky",
    "details":"Journal of Physics D: Applied Physics 50 174004, 2017",
    "doi":"10.1088/1361-6463/aa614d",
    "abstract":"Slime mold Physarum polycephalum optimizes its foraging behaviour by minimizing the distances between the sources of nutrients it spans. When two sources of nutrients are present, the slime mold connects the sources, with its protoplasmic tubes, along the shortest path. We present a two-dimensional mesh grid memristor based model as an approach to emulate Physarum's foraging strategy, which includes space exploration and reinforcement of the optimally formed interconnection network in the presence of multiple aliment sources. The proposed algorithmic approach utilizes memristors and LC contours and is tested in two of the most popular computational challenges for Physarum, namely maze and transportation networks. Furthermore, the presented model is enriched with the notion of noise presence, which positively contributes to a collective behavior and enables us to move from deterministic to robust results. Consequently, the corresponding simulation results manage to reproduce, in a much better qualitative way, the expected transportation networks.",
    "sjr_id":"28570"},
    
    { "j_id":"2",
    "title":"Oscillation-Based Slime Mould Electronic Circuit Model for Maze-Solving Computations",
    "authors":"<strong>Vasileios Ntinas</strong>, Ioannis Vourkas, Georgios Ch. Sirakoulis, Andrew Adamatzky",
    "details":"IEEE Transactions on Circuits and Systems I: Regular Papers, vol. 64, no. 6, pp. 1552-1563, 2017",
    "doi":"10.1109/TCSI.2016.2566278",
    "abstract":"The ability of slime mould to learn and adapt to periodic changes in its environment inspired scientists to develop behavioral memristor-based circuit models of its memory organization. The computing abilities of slime mould Physarum polycephalum have been used in several applications, including to solve mazes. This work presents a circuit-level bio-inspired maze-solving approach via an electronic model of the oscillatory internal motion mechanism of slime mould, which emulates the local signal propagation and the expansion of its vascular network. Our implementation takes into account the inherent noise existent in the equivalent biological circuit, so that its behavior becomes closer to the non-deterministic behavior of the real organism. The efficiency and generality of the proposed electronic computing medium was validated through SPICE-level circuit simulations and compared with data from two cardinally different biological experiments, concerning 1) enhancing of Physarum's protoplasmic tubes along shortest path and 2) chemo-tactic growth by diffusing chemo-attractants.",
    "sjr_id":"11000153733"},
    
    { "j_id":"1",
    "title":"Parallel Fuzzy Cellular Automata for Data Driven Simulation of Wildfire Spreading",
    "authors":"<strong>Vasileios G. Ntinas</strong>, Byron E. Moutafis, Giuseppe Andrea Trunfio, Georgios Ch. Sirakoulis",
    "details":"Journal of Computational Science, vol. 21, pp. 469-485, 2016",
    "doi":"10.1016/j.jocs.2016.08.003",
    "abstract":"Cellular Automata (CA) have been introduced many decades ago as one of the most efficient parallel computational models able to simulate various physical processes and systems where the interactions are local. In this paper, we are trying to advance the application of CA in modeling wildfires by accounting for the fuzziness intrinsic to the numerous environmental variables and mechanisms engaged with the emergence of the phenomenon itself. The proposed Fuzzy CA (FCA) model adopts a data-driven approach, based on evolutionary optimization, which allows incorporating knowledge from real wildfires in order to enhance its accuracy. The main difficulty for doing so arrives from the computational complexity of the proposed framework and the burden of computational resources needed for its application, which would prevent the real-time prediction of fire spread scenarios. In order to tackle the aforementioned difficulties, we propose model's fully parallel implementations in Graphical Processing Units (GPUs) and Field Programmable Gate Arrays (FPGAs) hardware. In the article, we first investigate the speedup achieved by the developed parallel implementations. Then, we present and discuss two applications to heterogeneous landscapes through comparisons with observed wildfires. Moreover, we compare the proposed framework with two different modelling approaches and results found are really promising.",
    "sjr_id":"19700174607"}],
  
  
  
  
  
  "conferences": [
    { "c_id":"37",
    "title":"A COMPLETE ANALYTICAL SOLUTION FOR THE ON AND OFF DYNAMIC EQUATIONS OF A TAO MEMRISTOR",
    "authors":"<strong>Vasileios Ntinas</strong>, Alon Ascoli, Ronald Tetzlaff, Georgios Ch. Sirakoulis",
    "details":"IEEE Transactions on Circuits and Systems II: Express Briefs, vol. 66, no. 4, pp. 682-686, 2019",
    "doi":"10.1109/TCSII.2018.2869920",
    "abstract":"In this brief we provide a complete analytical model for the time evolution of the state of a real-world memristor under any dc stimulus and for all initial conditions. The analytical dc model is derived through the application of mathematical techniques to Strachan's accurate mathematical description of a tantalum oxide nano-device from Hewlett Packard Labs. Under positive dc inputs the state equation of the Strachan model can be solved analytically, providing a closed-form expression for the device memory state response. However, to the best of our knowledge, the analytical integration of the state equation of the Strachan model under dc inputs of negative polarity is an unsolved mathematical problem. In order to bypass this issue, the state evolution function is first expanded in a series of Lagrange polynomials, which reproduces accurately the original model predictions on the device off-switching kinetics. The solution to the resulting state equation approximation may then be computed analytically by applying methods from the field of mathematics. Our full analytical model matches both qualitatively and quantitatively the tantalum oxide memristor response captured by the original differential algebraic equation set to typical stimuli of interest such as symmetric and asymmetric pulse excitations. It is further insensitive to the convergence issues that typically arise in the numerical integration of the original model, and may be easily integrated into software programs for circuit synthesis, providing designers with a reliable tool for exploratory studies on the capability of a certain circuit topology to satisfy given design specifications."}]
 }
