{
    "journals": [
        {
            "j_id": 1,
            "title": "Experimental study of artificial neural networks using a digital memristor simulator",
            "authors": "<strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Angel Abusleme,  Georgios Ch Sirakoulis,  Antonio Rubio",
            "details": "IEEE transactions on neural networks and learning systems, vol.29, no.10, pp.5098-5110, 2018",
            "abstract": "This paper presents a fully digital implementation of a memristor hardware (HW) simulator, as the core of an emulator, based on a behavioral model of voltage-controlled threshold-type bipolar memristors. Compared to other analog solutions, the proposed digital design is compact, easily reconfigurable, demonstrates very good matching with the mathematical model on which it is based, and complies with all the required features for memristor emulators. We validated its functionality using Altera Quartus II and ModelSim tools targeting low-cost yet powerful field-programmable gate array families. We tested its suitability for complex memristive circuits as well as its synapse functioning in artificial neural networks, implementing examples of associative memory and unsupervised learning of spatiotemporal correlations in parallel input streams using a simplified spike-timing-dependent plasticity. We provide the full …",
            "sjr_id": "21100235616",
            "url": "https://ieeexplore.ieee.org/abstract/document/8278839/",
            "cite_by": "https://scholar.google.com/scholar?cites=17410690805226792895"
        },
        {
            "j_id": 2,
            "title": "Parallel fuzzy cellular automata for data-driven simulation of wildfire spreading",
            "authors": "<strong>Vasileios G Ntinas</strong>,  Byron E Moutafis,  Giuseppe A Trunfio,  Georgios Ch Sirakoulis",
            "details": "Journal of computational science, vol.21, pp.469-485, 2017",
            "abstract": "Cellular Automata (CA) have been introduced many decades ago as one of the most efficient parallel computational models able to simulate various physical processes and systems where the interactions are local. In this paper, we are trying to advance the application of CA in modeling wildfires by accounting for the fuzziness intrinsic to the numerous environmental variables and mechanisms engaged with the emergence of the phenomenon itself. The proposed Fuzzy CA (FCA) model adopts a data-driven approach, based on evolutionary optimization, which allows incorporating knowledge from real wildfires in order to enhance its accuracy. The main difficulty for doing so arrives from the computational complexity of the proposed framework and the burden of computational resources needed for its application, which would prevent the real-time prediction of fire spread scenarios. In order to tackle the …",
            "sjr_id": "19700174607",
            "url": "https://www.sciencedirect.com/science/article/pii/S1877750316301260",
            "cite_by": "https://scholar.google.com/scholar?cites=8805169231266126083"
        },
        {
            "j_id": 3,
            "title": "Memristor crossbar for adaptive synchronization",
            "authors": "Lucia Valentina Gambuzza,  Mattia Frasca,  Luigi Fortuna,  <strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis",
            "details": "IEEE Transactions on Circuits and Systems I: Regular Papers, vol.64, no.8, pp.2124-2133, 2017",
            "abstract": "Nonlinear circuits may be synchronized with interconnections that evolve in time incorporating mechanisms of adaptation found in many biological systems. Such dynamics in the links is efficiently implemented in electronic devices by using memristors. However, the approach requires a massive amount of interconnections (of the order of N2, where N is the number of nonlinear circuits to be synchronized). This issue is solved in this paper by adopting a memristor crossbar architecture for adaptive synchronization. The functionality of the structure is demonstrated, with respect to different switching characteristics, via a simulation-based evaluation using a behavioral threshold-type model of voltage-controlled bipolar memristor. In addition, we show that the architecture is robust to device variability and faults: quite surprisingly, when faults are localized, the performance of the approach may also improve as adaptation …",
            "sjr_id": "11000153733",
            "url": "https://ieeexplore.ieee.org/abstract/document/7911226/",
            "cite_by": "https://scholar.google.com/scholar?cites=8190069393663242407"
        },
        {
            "j_id": 4,
            "title": "Oscillation-based slime mould electronic circuit model for maze-solving computations",
            "authors": "<strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis,  Andrew I Adamatzky",
            "details": "IEEE Transactions on Circuits and Systems I: Regular Papers, vol.64, no.6, pp.1552-1563, 2017",
            "abstract": "The ability of slime mould to learn and adapt to periodic changes in its environment inspired scientists to develop behavioral memristor-based circuit models of its memory organization. The computing abilities of slime mould Physarum polycephalum have been used in several applications, including to solve mazes. This work presents a circuit-level bio-inspired maze-solving approach via an electronic model of the oscillatory internal motion mechanism of slime mould, which emulates the local signal propagation and the expansion of its vascular network. Our implementation takes into account the inherent noise existent in the equivalent biological circuit, so that its behavior becomes closer to the non-deterministic behavior of the real organism. The efficiency and generality of the proposed electronic computing medium was validated through SPICE-level circuit simulations and compared with data from two cardinally …",
            "sjr_id": "11000153733",
            "url": "https://ieeexplore.ieee.org/abstract/document/7534815/",
            "cite_by": "https://scholar.google.com/scholar?cites=11439875455356658520"
        },
        {
            "j_id": 5,
            "title": "Modeling Physarum space exploration using memristors",
            "authors": "Vasilieios Ntinas,  Ioannis Vourkas,  G Ch Sirakoulis,  Andrew I Adamatzky",
            "details": "Journal of Physics D: Applied Physics, vol.50, no.17, pp.174004, 2017",
            "abstract": "Slime mold Physarum polycephalum optimizes its foraging behaviour by minimizing the distances between the sources of nutrients it spans. When two sources of nutrients are present, the slime mold connects the sources, with its protoplasmic tubes, along the shortest path. We present a two-dimensional mesh grid memristor based model as an approach to emulate Physarum's foraging strategy, which includes space exploration and reinforcement of the optimally formed interconnection network in the presence of multiple aliment sources. The proposed algorithmic approach utilizes memristors and LC contours and is tested in two of the most popular computational challenges for Physarum, namely maze and transportation networks. Furthermore, the presented model is enriched with the notion of noise presence, which positively contributes to a collective behavior and enables us to move from deterministic to robust …",
            "sjr_id": "28570",
            "url": "https://iopscience.iop.org/article/10.1088/1361-6463/aa614d/meta",
            "cite_by": "https://scholar.google.com/scholar?cites=16573809104661644007"
        },
        {
            "j_id": 6,
            "title": "Closed-form analytical solution for on-switching dynamics in a TaO memristor",
            "authors": "A Ascoli,  V Ntinas,  R Tetzlaff,  G Ch Sirakoulis",
            "details": "Electronics Letters, vol.53, no.16, pp.1125-1126, 2017",
            "abstract": "For the first time, the model of a physical nano-scale memristor is integrated analytically. A closed-form expression for the time evolution of the device memristance during the turn-on process is mathematically derived. The complexity of the inverse imaginary error function-based analytical formula clearly reflects the high degree of nonlinearity in the nano-device switching kinetics, which may typically span several orders of magnitude and is critically dependent on input and initial condition. The excellent agreement between the analytical solution and numerical simulation results clearly demonstrates the correctness of the theoretical derivation. The introduction of this formula represents the first step towards a systematic approach to circuit design with memristors.",
            "sjr_id": "24918",
            "url": "https://digital-library.theiet.org/content/journals/10.1049/el.2017.1622",
            "cite_by": "https://scholar.google.com/scholar?cites=9672778571330767273"
        },
        {
            "j_id": 7,
            "title": "A complete analytical solution for the on and off dynamic equations of a TaO memristor",
            "authors": "V Ntinas,  Alon Ascoli,  Ronald Tetzlaff,  G Ch Sirakoulis",
            "details": "IEEE Transactions on Circuits and Systems II: Express Briefs, vol.66, no.4, pp.682-686, 2018",
            "abstract": "In this brief we provide a complete analytical model for the time evolution of the state of a real-world memristor under any dc stimulus and for all initial conditions. The analytical dc model is derived through the application of mathematical techniques to Strachan's accurate mathematical description of a tantalum oxide nano-device from Hewlett Packard Labs. Under positive dc inputs the state equation of the Strachan model can be solved analytically, providing a closed-form expression for the device memory state response. However, to the best of our knowledge, the analytical integration of the state equation of the Strachan model under dc inputs of negative polarity is an unsolved mathematical problem. In order to bypass this issue, the state evolution function is first expanded in a series of Lagrange polynomials, which reproduces accurately the original model predictions on the device off-switching kinetics. The …",
            "sjr_id": "9500153930",
            "url": "https://ieeexplore.ieee.org/abstract/document/8463511/",
            "cite_by": "https://scholar.google.com/scholar?cites=14673238189577477560"
        },
        {
            "j_id": 8,
            "title": "Power-efficient Noise-Induced Reduction of ReRAM Cell’s Temporal Variability Effects",
            "authors": "<strong>Vasileios Ntinas</strong>,  Antonio Rubio,  Georgios Ch Sirakoulis,  Emili Salvador Aguilera,  Marta Pedro,  Albert Crespo-Yepes,  Javier Martin-Martinez,  Rosana Rodriguez,  Montserrat Nafria",
            "details": "IEEE Transactions on Circuits and Systems II: Express Briefs, 2020",
            "abstract": "Resistive Random Access Memory (ReRAM) is a promising novel memory technology for non-volatile storing, with low-power operation and ultra-high area density. However, ReRAM memories still face issues through commercialization, mainly owing to the fact that the high fabrication variations and the stochastic switching of the manufactured ReRAM devices cause high Bit Error Rate (BER). Given that ReRAM devices are nonlinear elements, the nonlinear phenomenon of Stochastic Resonance (SR), which defines that an input disturbance with specific characteristics can improve the total performance of the nonlinear system, is used to reduce the ReRAM cell’s BER. Thus, in this work, the BER of a single ReRAM cell is explored, using the Stanford PKU model, and is improved after the application of specific additive input noise. The power dissipation of the proposed approach is also evaluated and compared …",
            "sjr_id": "9500153930",
            "url": "https://ieeexplore.ieee.org/abstract/document/9205867/",
            "cite_by": "https://scholar.google.com/scholar?cites=4285466312942920301"
        },
        {
            "j_id": 9,
            "title": "Quantum Mechanical Model for Filament Formation in Metal-Insulator-Metal Memristors",
            "authors": "Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Georgios Ch Sirakoulis,  Panagiotis Dimitrakis,  Ioannis G Karafyllidis",
            "details": "IEEE Transactions on Nanotechnology, 2021",
            "abstract": "Metal-Insulator-Metal type memristors as emergent nano-electronic devices have been successfully fabricated and used in non-conventional and neuromorphic computing systems in the last years. Several behavioral or physical based models have been developed to explain their operation and to optimize their fabrication parameters. Among them, the resistance switching of the insulating layer due to the formation of conductive filaments is the most well respected and experimentally proven. All existing memristor models are trade-offs between accuracy, universality and realism, but, to the best of our knowledge, none of them is purely characterized as quantum mechanical, despite the fact that quantum mechanical processes are a major part of the memristor operation. In this paper, we employ quantum mechanical methods to develop a complete and accurate filamentary model for the resistance variation during …",
            "sjr_id": "15464",
            "url": "https://ieeexplore.ieee.org/abstract/document/9316152/",
            "cite_by": ""
        },
        {
            "j_id": 10,
            "title": "Probabilistic Resistive Switching Device modeling based on Markov Jump processes",
            "authors": "<strong>Vasileios Ntinas</strong>,  Antonio Rubio,  Georgios Ch Sirakoulis",
            "details": "IEEE Access, 2020",
            "abstract": "In this work, a versatile mathematical framework for multi-state probabilistic modeling of Resistive Switching (RS) devices is proposed for the first time. The mathematical formulation of memristor and Markov jump processes are combined and, by using the notion of master equations for finite-states, the inherent probabilistic time-evolution of RS devices is sufficiently modeled. In particular, the methodology is generic enough and can be applied for     states; as a proof of concept, the proposed framework is further stressed for both a two-state RS paradigm, namely    , and a multi-state device, namely    . The presented I–V results demonstrate in a qualitative and quantitative manner, adequate matching with other modeling approaches.",
            "sjr_id": "21100374601",
            "url": "https://ieeexplore.ieee.org/abstract/document/9276482/",
            "cite_by": ""
        }
    ],
    "conferences": [
        {
            "c_id": 1,
            "title": "A digital memristor emulator for FPGA-based artificial neural networks",
            "authors": "Ioannis Vourkas,  Angel Abusleme,  <strong>Vasileios Ntinas</strong>,  Georgios Ch Sirakoulis,  Antonio Rubio",
            "details": "2016 1st IEEE International Verification and Security Workshop (IVSW), pp.1-4, 2016",
            "abstract": "FPGAs are reconfigurable electronic platforms, well-suited to implement complex artificial neural networks (ANNs). To this end, the compact hardware (HW) implementation of artificial synapses is an important step to obtain human brain-like functionalities at circuit-level. In this context, the memristor has been proposed as the electronic analogue of biological synapses, but the price of commercially available samples still remains high, hence motivating the development of HW emulators. In this work we present the first digital memristor emulator based upon a voltage-controlled threshold-type bipolar memristor model. We validate its functionality in low-cost yet powerful FPGA families. We test its suitability for complex memristive circuits and prove its synaptic properties in a small associative memory via a perceptron ANN.",
            "url": "https://ieeexplore.ieee.org/abstract/document/7566607/",
            "cite_by": "https://scholar.google.com/scholar?cites=15851004260813659821"
        },
        {
            "c_id": 2,
            "title": "LC filters with enhanced memristive damping",
            "authors": "<strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis",
            "details": "2015 IEEE International Symposium on Circuits and Systems (ISCAS), pp.2664-2667, 2015",
            "abstract": "Within an ever-increasing variety of applications for memristors, adaptive electronic circuits have attracted considerable attention lately. This paper extends previously published work on memristive filter design to include the potential of composite memristive devices as damping elements in LC-based sensing circuits. The collective response of several LC contours with different memristive damping is considered. A thorough study of the circuit properties is performed in an attempt to exploit the high sensitivity of the circuit, other than address it as a typical drawback. The simulated circuits could find application in bio-inspired information processing, whereas could lead to better behavioral models for biological organisms.",
            "url": "https://ieeexplore.ieee.org/abstract/document/7169234/",
            "cite_by": "https://scholar.google.com/scholar?cites=14358617756207472084"
        },
        {
            "c_id": 3,
            "title": "Transformation techniques applied to a TaO memristor model to enable stable device simulations",
            "authors": "<strong>Vasileios Ntinas</strong>,  Alon Ascoli,  Ronald Tetzlaff,  Georgios Ch Sirakoulis",
            "details": "2017 European Conference on Circuit Theory and Design (ECCTD), pp.1-4, 2017",
            "abstract": "Given the complexity of the mathematical descriptions of real nanodevices with memristor fingerprints, convergence issues often emerge in the simulation of circuits employing memristors, even for a limited number of instances. Actually the simulation of one-memristor circuits may also be troublesome for some inputs and/or initial conditions. This problem prevents a thorough test of memristor circuit designs, representing a severe obstacle towards an extensive use of memristors in electronics. In this work we propose techniques to transform a highly-reliable physics-based model of the Tantalum oxide memristor from Hewlett Packard Labs in a form which lends itself naturally to stable numerical simulations. The results of this study shall pave the way towards a more extensive exploration of the full potential of memristors in integrated circuit design.",
            "url": "https://ieeexplore.ieee.org/abstract/document/8093286/",
            "cite_by": "https://scholar.google.com/scholar?cites=10966439498474918647"
        },
        {
            "c_id": 4,
            "title": "Game of life in memristor cellular automata grid",
            "authors": "Rafailia-Eleni Karamani,  Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis",
            "details": "CNNA 2018; The 16th International Workshop on Cellular Nanoscale Networks and their Applications, pp.1-4, 2018",
            "abstract": "Conway's Game of Life (GoL), a zero-player game which belongs to the category of Life-like Cellular Automata (CA), has intrigued researchers from a wide range of scientific areas as it exhibits self organization, the emergence of complex patterns while even implementing a universal Turing machine, despite its simplistic nature. In general, CA is a biologically inspired computational model which is able to approach the behavior of complex natural phenomena by utilizing the locality of interconnected simple elements, namely the CA cells. This work proposes a novel CA cell which exploits the advantages of memristor devices, such as adaptivity and CMOS compatibility, to reproduce the behavior of GoL in circuit-level. Such designs are essential for the development of application specific future electronic systems that will be able to operate in real-time and communicate with other biological systems. The proposed …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8470470/",
            "cite_by": "https://scholar.google.com/scholar?cites=11309085176532145510"
        },
        {
            "c_id": 5,
            "title": "A Pragmatic Gaze on Stochastic Resonance Based Variability Tolerant Memristance Enhancement",
            "authors": "<strong>Vasileios Ntinas</strong>,  Antonio Rubio,  Georgios Ch Sirakoulis,  Sorin D Cotofana",
            "details": "2019 IEEE International Symposium on Circuits and Systems (ISCAS), pp.1-5, 2019",
            "abstract": "Stochastic Resonance (SR) is a nonlinear system specific phenomenon, which was demonstrated to lead to system unexpected (counter-intuitive) performance improvements under certain noise conditions. Memristor, on the other hand, is a fundamentally nonlinear circuit element, thus susceptible to benefit from SR, which recently came in the spotlight of the emerging technologies potential candidates. However, at this time, the variability exhibited by manufactured memristor devices within the same array constitutes the main hurdle in the road towards the commercialisation of memristor-based memories and/or computing units. Thus, in this paper, memristor SR effects are explored, assuming various memristor models, and SR-based memristance range enhancement, tolerant to device-to-device variability, is demonstrated. Our experiments reveal that SR can induce significant R MAX /R MIN  ratio increase under …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8702792/",
            "cite_by": "https://scholar.google.com/scholar?cites=10722466095745741055"
        },
        {
            "c_id": 6,
            "title": "Coupled physarum-inspired memristor oscillators for neuron-like operations",
            "authors": "<strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis,  Andrew Adamatzky,  Antonio Rubio",
            "details": "2018 IEEE International Symposium on Circuits and Systems (ISCAS), pp.1-5, 2018",
            "abstract": "Unconventional computing has been studied intensively, even after the appearance of CMOS technology. Currently, it has returned to the spotlight because CMOS is about to reach its physical limits, given that the constant demand for more computational power requires for novel unconventional computing solutions. In this area, the oscillatory internal motion mechanism of slime mould, namely  Physarum Polycephalum , could serve as an alternative concept for the design and development of electronic circuits that exploit the memristive dynamics and simple LC contours to deliver solutions for computationally hard to be solved problems. In this direction, this work presents how bio-inspired memristive LC oscillators with a coupling capacitor can be synchronized to perform the functionalities of a biological neuron, also able to execute more complex computations, aiming to model biological neural systems much more …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8351701/",
            "cite_by": "https://scholar.google.com/scholar?cites=7694295641838977721"
        },
        {
            "c_id": 7,
            "title": "Memristive cellular automata for modeling of epileptic brain activity",
            "authors": "Rafailia-Eleni Karamani,  Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis,  Antonio Rubio",
            "details": "2018 IEEE International Symposium on Circuits and Systems (ISCAS), pp.1-5, 2018",
            "abstract": "Cellular Automata (CA) is a nature-inspired and widespread computational model which is based on the collective and emergent parallel computing capability of units (cells) locally interconnected in an abstract brain-like structure. Each such unit, referred as CA cell, performs simplistic computations/processes. However, a network of such identical cells can exhibit nonlinear behavior and be used to model highly complex physical phenomena and processes and to solve problems that are highly complicated for conventional computers. Brain activity has always been considered one of the most complex physical processes and its modeling is of utter importance. This work combines the CA parallel computing capability with the nonlinear dynamics of the memristor, aiming to model brain activity during the epileptic seizures caused by the spreading of pathological dynamics from focal to healthy brain regions. A CA …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8351805/",
            "cite_by": "https://scholar.google.com/scholar?cites=1674381446038939652"
        },
        {
            "c_id": 8,
            "title": "1-D memristor-based cellular automaton for pseudo-random number generation",
            "authors": "Rafailia-Eleni Karamani,  <strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis",
            "details": "2017 27th International Symposium on Power and Timing Modeling, Optimization and Simulation (PATMOS), pp.1-6, 2017",
            "abstract": "Cellular Automata (CAs) is a well-known parallel, bio-inspired, computational model. It is based on the capability of simpler, locally interacting units, i.e. the CAs cells, to evolve in time, giving rise to emergent computation, suitable to model physical system behavior, prediction of natural phenomena and multi-dimensional problem solutions. Moreover, at the same time CAs constitute a promising computing platform, beyond the von Neumann architecture. In this paper, a memristor device is considered to be the basic module of a CA cell circuit implementation, performing as a combined memory and processing element to implement CA-based circuits, able to model sufficiently systems and applications as mentioned above, targeting tentatively to a more energy efficient design compared to the conventional electronics. In particular and as a proof of concept, the results of elementary CAs modeling and simulation for the …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8106991/",
            "cite_by": "https://scholar.google.com/scholar?cites=8503303294793299812"
        },
        {
            "c_id": 9,
            "title": "Wave computing with passive memristive networks",
            "authors": "Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Georgios Ch Sirakoulis,  Andrew Adamatzky,  Victor Erokhin,  Antonio Rubio",
            "details": "2019 IEEE International Symposium on Circuits and Systems (ISCAS), pp.1-5, 2019",
            "abstract": "Since CMOS technology approaches its physical limits, the spotlight of computing technologies and architectures shifts to unconventional computing approaches. In this area, novel computing systems, inspired by natural and mostly nonelectronic approaches, provide also new ways of performing a wide range of computations, from simple logic gates to solving computationally hard problems. Reaction-diffusion processes constitute an information processing method, occurs in nature and are capable of massive parallel and low-power computing, such as chemical computing through Belousov-Zhabotinsky reaction. In this paper, inspired by these chemical processes and based on the wave-propagation information processing taking place in the reaction-diffusion media, the novel characteristics of the nanoelectronic element memristor are utilized to design innovative circuits of electronic excitable medium to perform …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8702789/",
            "cite_by": "https://scholar.google.com/scholar?cites=10933688673148929496"
        },
        {
            "c_id": 10,
            "title": "A new approach based on memristor crossbar for synchronization",
            "authors": "Lucia Valentina Gambuzza,  Mattia Frasca,  Luigi Fortuna,  <strong>Vasileios Ntinas</strong>,  Ioannis Vourkas,  Georgios Ch Sirakoulis",
            "details": "CNNA 2016; 15th International Workshop on Cellular Nanoscale Networks and their Applications, pp.1-2, 2016",
            "abstract": "We propose the use of memristor crossbar for synchronizing nonlinear chaotic circuits. By means of this approach, the nonlinearity and memory features of the memristors are exploited to massively couple the dynamical system units with weights (the state variable of the memristors) which evolve as function of the differences between the state variables of the circuits. In this extended abstract we briefly illustrate the approach and numerical results confirming its suitability.",
            "url": "https://ieeexplore.ieee.org/abstract/document/7827962/",
            "cite_by": "https://scholar.google.com/scholar?cites=2995156001513556807"
        },
        {
            "c_id": 11,
            "title": "Cellular automata coupled with memristor devices: A fine unconventional computing paradigm",
            "authors": "<strong>Vasileios Ntinas</strong>,  Rafailia-Eleni Karamani,  Iosif-Angelos Fyrigos,  Nikolaos Vasileiadis,  Dimitrios Stathis,  Ioannis Vourkas,  Panagiotis Dimitrakis,  Ioannis Karafyllidis,  Georgios Ch Sirakoulis",
            "details": "2020 International Conference on Electronics, Information, and Communication (ICEIC), pp.1-4, 2020",
            "abstract": "Cellular Automata (CAs), a ubiquitous computational tool proposed by John von Neumann, illustrate how great complexity emerges from simple rules of dynamical transitions between space and time interconnected simplistic entities. CAs perform as mathematical computation models, but also they are a powerful medium to model nature and natural systems. As a computational platform, CAs come with unified memory and computation in the same physical area, attributed as a strong candidate against the limitations of data transfer, known as the von Neumann bottleneck. On the other hand, Memristors with their inherent Computing-In-Memory compatibility, can be easily considered as appropriate nanoelectronic devices to be coupled with CAs towards an energy and time efficient computational paradigm. In particular, CA present a vast area of applications, comprising various   -complete hard to be solved …",
            "url": "https://ieeexplore.ieee.org/abstract/document/9051236/",
            "cite_by": "https://scholar.google.com/scholar?cites=16013186794468753719"
        },
        {
            "c_id": 12,
            "title": "Noise-induced Performance Enhancement of Variability-aware Memristor Networks",
            "authors": "<strong>Vasileios Ntinas</strong>,  Iosif-Angelos Fyrigos,  Georgios Ch Sirakoulis,  Antonio Rubio,  Javier Martín-Martinez,  Rosana Rodríguez,  Montserrat Nafría",
            "details": "2019 26th IEEE International Conference on Electronics, Circuits and Systems (ICECS), pp.731-734, 2019",
            "abstract": "Memristor networks are capable of low-power, massive parallel processing and information storage. Moreover, they have widely used for a vast number of intelligent data analysis applications targeting mobile edge devices and low power computing. However, till today, one of the major drawbacks resulting to their commercial cumbersome growth, is the fact that the fabricated memristor devices are subject to device-to-device and cycle-to-cycle variability that strongly affects the performance of the memristive network and restricts, in a sense, the utilisation of such systems for real-life demanding applications. In this work, we put effort on increasing the performance of memristive networks by incorporating external additive noise that will be proven to have a beneficial role for the memristor devices and networks. More specifically, we are taking inspiration from the well-known non-linear system phenomenon, called …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8965134/",
            "cite_by": "https://scholar.google.com/scholar?cites=1487645763950423793"
        },
        {
            "c_id": 13,
            "title": "Experimental Investigation of Memristance Enhancement",
            "authors": "<strong>Vasileios Ntinas</strong>,  Antonio Rubio,  Georgios Ch Sirakoulis,  Rosana Rodríguez,  Montserrat Nafría",
            "details": "2019 IEEE/ACM International Symposium on Nanoscale Architectures (NANOARCH), pp.1-2, 2019",
            "abstract": "Memristor devices are two-terminal nanoscale circuit elements that exhibit nonvolatile information storing and can be manufactured in ultra-dense arrays with low-power operation. Although, theoretically, memristors are strong candidates for novel memory and computing applications, the fabricated devices show high variability, both device-to-device and cycle-to-cycle, such as varying switching behaviour and maximum (R MAX ) and minimum (R MIN ) resistance values. Those limitations in the device’s R MAX /R MIN  ratio suppress the wide use of memristors in memory or logic applications, thus, this work presents the enhancement of this ratio on actual memristor devices, namely Knowm memristors, due to the introduction of external noise as a beneficial disturbance, following the nonlinear system phenomenon known as Stochastic Resonance.",
            "url": "https://ieeexplore.ieee.org/abstract/document/9073637/",
            "cite_by": "https://scholar.google.com/scholar?cites=8923820935176949004"
        },
        {
            "c_id": 14,
            "title": "Future and Emergent Materials and Devices for Resistive Switching",
            "authors": "Panagiotis Karakolis,  Pascal Normand,  Panagiotis Dimitrakis,  <strong>Vasileios Ntinas</strong>,  Iosif-Angelos Fyrigos,  Ioannis Karafyllidis,  Georgios Ch Sirakoulis",
            "details": "2018 IEEE 13th Nanotechnology Materials and Devices Conference (NMDC), pp.1-5, 2018",
            "abstract": "During the last years, Resistive Random-Access Memories (ReRAMs or RRAMs) stimulated growing attention as promising non-volatile (NV) candidate memories to surpass existing storage devices while exhibiting excellent performance, reliability and low-energy operation and in the same time be utilized for unconventional computing paradigms such as neuromorphic and in-memory computation. In this paper, a brief review on the current state of the art for RRAMs is provided mainly focusing on the resistance switching mechanisms for various materials and corresponding devices. More specifically, we report on the switching mechanisms of RRAMs considering resistance bi-stability due to phase transformation, interfacial resistive switching, conductive filaments and thermochemical effects while the effect of environmental conditions like moisture and temperature is also analyzed. Finally, preliminary results …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8605885/",
            "cite_by": "https://scholar.google.com/scholar?cites=12192401418320751356"
        },
        {
            "c_id": 15,
            "title": "Early approach of qubit state representation with memristors",
            "authors": "Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Ioannis Karafyllidis,  Georgios Ch Sirakoulis,  Panagiotis Karakolis,  Panagiotis Dimitrakis",
            "details": "ANNA'18; Advances in Neural Networks and Applications 2018, pp.1-5, 2018",
            "abstract": "In this paper we explore further the potential coupling of quantum computing with memristor technology. Taking the lead from co-authors' previous work, we are examining a number of memristor models and configurations corresponding to real memristor devices, aiming to the possible improvement of quantum bit (qubit) state representation with appropriate memristor states. Simulations results of the aforementioned models and configurations present in a qualitative and quantitative way the feasibility of this study in an efficient manner.",
            "url": "https://ieeexplore.ieee.org/abstract/document/8576702/",
            "cite_by": "https://scholar.google.com/scholar?cites=6941742154111891675"
        },
        {
            "c_id": 16,
            "title": "Memristive oscillatory circuits for resolution of NP-complete logic puzzles: Sudoku case",
            "authors": "Theodoros Panagiotis Chatzinikolaou,  Iosif-Angelos Fyrigos,  Rafailia-Eleni Karamani,  <strong>Vasileios Ntinas</strong>,  Giorgos Dimitrakopoulos,  Sorin Cotofana,  Georgios Ch Sirakoulis",
            "details": "2020 IEEE International Symposium on Circuits and Systems (ISCAS), pp.1-5, 2020",
            "abstract": "Memristor networks are capable of low-power and massive parallel processing and information storage. Moreover, they have presented the ability to apply for a vast number of intelligent data analysis applications targeting mobile edge devices and low power computing. Beyond the memory and conventional computing architectures, memristors are widely studied in circuits aiming for increased intelligence that are suitable to tackle complex problems in a power and area efficient manner, offering viable solutions oftenly arriving also from the biological principles of living organisms. In this paper, a memristive circuit exploiting the dynamics of oscillating networks is utilized for the resolution of very popular and NP-complete logic puzzles, like the well-known “Sudoku”. More specifically, the proposed circuit design methodology allows for appropriate usage of interconnections' advantages in a oscillation network and of …",
            "url": "https://ieeexplore.ieee.org/abstract/document/9181110/",
            "cite_by": ""
        },
        {
            "c_id": 17,
            "title": "Implementation and Optimization of Chemical Logic Gates Using Memristive Cellular Automata",
            "authors": "Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Michail-Antisthenis Tsompanas,  Stavros Kitsios,  Georgios Ch Sirakoulis,  Dimitris Tsoukalas,  Andrew Adamatzky",
            "details": "2020 European Conference on Circuit Theory and Design (ECCTD), pp.1-6, 2020",
            "abstract": "By utilizing biologically inspired approaches, a wide range of complex and computationally intensive problems can be transformed to simpler and more appropriate forms to be easily solved by unconventional computing systems. A well-known computing platform with such characteristics is the Cellular Automata paradigm, where a spatial-extended network of nodes, with local interactions, exhibit emerging computations. In such CA networks, the application of nanodevices, like memristors, with inherent novel abilities, like memory storing and computing capabilities, together with nonlinear interactions is promising for the advancement of computation. In this work, a memristor-based Cellular Automaton (MemCA) is developed for the implementation and optimization of topological chemical logic gates. The proposed MemCA is inspired by the behaviour of the biological organism Physarum Polycephalum that firstly …",
            "url": "https://ieeexplore.ieee.org/abstract/document/9218330/",
            "cite_by": ""
        },
        {
            "c_id": 18,
            "title": "Memristive Learning Cellular Automata: Theory and Applications",
            "authors": "Rafailia-Eleni Karamani,  Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Orestis Liolis,  Giorgos Dimitrakopoulos,  Mustafa Altun,  Andrew Adamatzky,  Mircea R Stan,  Georgios Ch Sirakoulis",
            "details": "2020 9th International Conference on Modern Circuits and Systems Technologies (MOCAST), pp.1-5, 2020",
            "abstract": "Memristors are novel non volatile devices that manage to combine storing and processing capabilities in the same physical place. Their nanoscale dimensions and low power consumption enable the further design of various nanoelectronic processing circuits and corresponding computing architectures, like neuromorphic, in memory, unconventional, etc. One of the possible ways to exploit the memristor’s advantages is by combining them with Cellular Automata (CA). CA constitute a well known non von Neumann computing architecture that is based on the local interconnection of simple identical cells forming N-dimensional grids. These local interconnections allow the emergence of global and complex phenomena. In this paper, we propose a hybridization of the CA original definition coupled with memristor based implementation, and, more specifically, we focus on Memristive Learning Cellular Automata (MLCA …",
            "url": "https://ieeexplore.ieee.org/abstract/document/9200246/",
            "cite_by": ""
        },
        {
            "c_id": 19,
            "title": "Memristor Hardware Accelerator of Quantum Computations",
            "authors": "Iosif-Angelos Fyrigos,  <strong>Vasileios Ntinas</strong>,  Georgios Ch Sirakoulis,  Panagiotis Dimitrakis,  Ioannis Karafyllidis",
            "details": "2019 26th IEEE International Conference on Electronics, Circuits and Systems (ICECS), pp.799-802, 2019",
            "abstract": "Quantum computing and quantum computers are a major part of the second quantum revolution. Existing quantum algorithms can natively solve complex problems, such as the prime number factorization and searching of unstructured databases, in a fast and efficient way. The main obstacle towards building large and efficient quantum computers is decoherence, which produces errors that have to be continuously corrected using quantum error correcting codes. Beyond the realisation of quantum computing systems with actual quantum hardware, quantum algorithms have been developed based on quantum logic gates that can be described and utilised by classical computers and proper interfaces based on linear algebra operations. Furthermore, memristive grids have been proposed as novel nanoscale and low-power hardware accelerators for the time-consuming matrix-vector multiplication and tensor products …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8965109/",
            "cite_by": ""
        },
        {
            "c_id": 20,
            "title": "Plasma Modified Silicon Nitride Resistive Switching Memories",
            "authors": "P Karakolis,  P Normand,  Panagiotis Dimitrakis,  L Sygelou,  V Ntinas,  Iosif-Angelos Fyrigos,  Ioannis Karafyllidis,  G Ch Sirakoulis",
            "details": "2019 IEEE/ACM International Symposium on Nanoscale Architectures (NANOARCH), pp.1-2, 2019",
            "abstract": "In this article we present RRAM single-cells based on MIS devices utilizing LPCVD silicon nitride thin layer as resistive switching material. The thin SiN layer was modified by plasma in order to improve the switching characteristics and the overall performance of the memory cell. Extensive material and electronic device characterization are presented.",
            "url": "https://ieeexplore.ieee.org/abstract/document/9073660/",
            "cite_by": ""
        },
        {
            "c_id": 21,
            "title": "Memristive Circuits for the Simulation of the Earthquake Process",
            "authors": "Grigorios Tastzoglou,  <strong>Vasileios Ntinas</strong>,  Ioakeim G Georgoudas,  Angelos Amanatiadis,  Georgios Ch Sirakoulis",
            "details": "2019 8th International Conference on Modern Circuits and Systems Technologies (MOCAST), pp.1-4, 2019",
            "abstract": "In this study, a grid that consists of inductor-capacitor-memristor circuits has been developed to simulate earthquake propagation. The main advantage of the memristor device is its ability to remember its last state even when no voltage is applied to it. Due to this feature, the use of the memristor is favored in the proposed inductor-capacitor-memristor (LCM) circuit. The inductors and capacitors emulate the oscillation of the rocks, whereas the memristors engage the circuit's energy loss and act as the memory that the data affecting the earthquake propagation process is stored. In the context of this study, the proposed circuit model is designed on the LTspice platform. Furthermore, it is tested and validated with real seismic data. Preliminary results are quite encouraging regarding the response of the proposed model.",
            "url": "https://ieeexplore.ieee.org/abstract/document/8742062/",
            "cite_by": ""
        },
        {
            "c_id": 22,
            "title": "Analytical DC model of a TaO memristor",
            "authors": "A Ascoli,  R Tetzlaff,  V Ntinas,  G Ch Sirakoulis",
            "details": "ANNA'18; Advances in Neural Networks and Applications 2018, pp.1-5, 2018",
            "abstract": "Circuit designers are used to employ analytical formulas and numerically stable expressions for the input-output behaviour of electronic components in preliminary calculations intended to select the most suitable circuit topology to meet prescribed design specifications. Manufactured memristors are highly-nonlinear dynamical circuit elements for new future electronics. However the Differential Algebraic Equation sets, used to capture accurately their nonlinear dynamics, typically consist of involved mathematical expressions, which prevent their analytical integration and the derivation of input-output formulas for circuit design. Adopting certain mathematical techniques, we were recently able to derive for the first time, formulas for the DC behaviour of a real-world memristor exhibiting both non-volatility and fading memory. Particularly, on the basis of an accurate mathematical model, this paper presents a set of …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8576700/",
            "cite_by": ""
        },
        {
            "c_id": 23,
            "title": "Towards an analytical description of a TaO memristor",
            "authors": "Alon Ascoli,  Ronald Tetzlaff,  <strong>Vasileios Ntinas</strong>,  Georgios Ch. Sirakoulis",
            "details": "Electronics and Telecommunications (PACET), 2017 Panhellenic Conference on, 2018",
            "abstract": "Memristors promise to revolutionise the world of electronics in the years to come. Besides their most popular applications in the fields of non-volatile memory design and neuro-morphic system development, their ability to process signals and store data in the same physical location may allow the conception of novel mem-computing machines outperforming state-of-the-art hardware systems suffering from the Von Neumann bottleneck. The complexity of real-world memristor models, capturing the inherent nonlinearity of the switching kinetics of the nanodevices, is one of the obstacles towards an extensive exploration of the full potential of memristors in nanoelectronics. It is well-known, in fact, that serious convergence issues frequently arise in the numerical simulation of the differential algebraic equation sets modelling the dynamics of real-world memristors. In this work we propose a strategy to develop a general …",
            "url": "https://ieeexplore.ieee.org/abstract/document/8259948/",
            "cite_by": ""
        }
    ]
}
